# Obtén y conoce tus datos



### 1. Importa las librerías necesarias

In [16]:
import pandas as pd

### 2. Importa el dataset de este [enlace](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user) y guárdalo en una variable llamada users. Usa pd.read_csv()

In [74]:
fichero = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user' 
users = pd.read_csv(fichero, sep='|', index_col='user_id') 
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### 3. Muestra las 25 primeros registros

In [56]:
users.iloc[0:25] # La función "iloc[]" se utiliza para acceder a los datos en un DataFrame utilizando índices enteros en lugar de etiquetas de fila y columna.

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### 4. Muestra las 25 primeros registros de otra forma

In [55]:
users.head(5) # MUESTRA LOS N PRIMEROS REGISTROS DEL DATAFRAME

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### 5. Muestra los últimos 25 registros

In [20]:
data.tail(25) # MUESTRA LOS N ÚLTIMOS REGISTROS DEL DATAFRAME

         age gender     occupation zip_code
user_id
919       25      M          other    14216
920       30      F         artist    90008
921       20      F        student    98801
922       29      F  administrator    21114
923       21      M        student    E2E3R
924       29      M          other    11753
925       18      F       salesman    49036
926       49      M  entertainment    01701
927       23      M     programmer    55428
928       21      M        student    55408
929       44      M      scientist    53711
930       28      F      scientist    07310
931       60      M       educator    33556
932       58      M       educator    06437
933       28      M        student    48105
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### 6. Cuántos registros hay en total en este dataset?
Resuélvelo de al menos dos formas diferentes

In [57]:
len(users)

943

In [26]:
users.count('columns')

user_id
1      4
2      4
3      4
4      4
5      4
      ..
939    4
940    4
941    4
942    4
943    4
Length: 943, dtype: int64

### 7. Cuántas columnas hay en total en este dataset?
Resuélvelo de al menos dos formas diferentes

In [47]:
cantidad_columnas = users.shape[1] # '1' MUESTRA LA CANTIDAD DE COLUMNAS, Y '0' MUESTRA LA CANTIDAD DE FILAS 

print(cantidad_columnas)

4

### 8. Haz un print de cada uno de los nombres de las columnas

In [52]:
nombre_columnas = users.columns # 'columns' DEVUELVE EL NOMBRE DE LAS COLUMNAS DEL DATAFRAME 
print(nombre_columnas)

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [51]:
print(*users.columns.values) # DEVUELVE LOS NOMBRES DE LAS COLUMNAS

age gender occupation zip_code

### 9. Accede al índice, a los nombres de las columnas y a los valores por separado

In [58]:
users.head # '.head' RESUME TODA LA INFORMACIÓN DEL DATAFRAME

<bound method NDFrame.head of          age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]>

### 10. Cuál es el tipo de cada columna del dataset?
Hazlo de dos formas diferentes

In [60]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [30]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### 11. Haz un print solo de la columna de occupation
Hazlo de dos formas diferentes

In [31]:
print(users["occupation"])

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [61]:
print(users.occupation)

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### 12. ¿Cuántas profesiones diferentes hay? ¿Y personas por profesión?

In [32]:
len(set(users["occupation"].values))

21

In [63]:
users["occupation"].unique() # LA FUNCION '.unique()' DEVUELVE TODOS LOS VALORES DISTINTOS DE LA COLUMNA ESPECIFICADA

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [62]:
users["occupation"].nunique() # LA FUNCIÓN 'nunique()' DEVUELVE LA CANTIDAD DE VALORES DISTINTOS QUE TIENE LA COLUMNA ESPECIFICADA

21

In [65]:
# Iterar sobre cada profesión única en la columna 'occupation' 

for profesion in users["occupation"].unique():

    # Crear una condición para filtrar las filas donde la 'occupation' es igual a la profesión actual 

    condition = users["occupation"] == profesion 

    # Contar el número de personas para la profesión actual 

    cantidad_personas = users[condition].shape[0] 

    # Imprimir el resultado 
    
    print(f"{profesion} tiene {cantidad_personas} personas")

technician tiene 27 personas
other tiene 105 personas
writer tiene 45 personas
executive tiene 32 personas
administrator tiene 79 personas
student tiene 196 personas
lawyer tiene 12 personas
educator tiene 95 personas
scientist tiene 31 personas
entertainment tiene 18 personas
programmer tiene 66 personas
librarian tiene 51 personas
homemaker tiene 7 personas
artist tiene 28 personas
engineer tiene 67 personas
marketing tiene 26 personas
none tiene 9 personas
healthcare tiene 16 personas
retired tiene 14 personas
salesman tiene 12 personas
doctor tiene 7 personas

In [44]:
users.groupby("occupation").count()

               age  gender  zip_code
occupation
administrator   79      79        79
artist          28      28        28
doctor           7       7         7
educator        95      95        95
engineer        67      67        67
entertainment   18      18        18
executive       32      32        32
healthcare      16      16        16
homemaker        7       7         7
lawyer          12      12        12
librarian       51      51        51
marketing       26      26        26
none             9       9         9
other          105     105       105
programmer      66      66        66
retired         14      14        14
salesman        12      12        12
scientist       31      31        31
student        196     196       196
technician      27      27        27
writer          45      45        45

### 13. ¿Cuál es la profesión más común?

In [43]:
max_value = 0 
max_prof = ''

for profesion in users["occupation"].unique():
    condicion = users["occupation"] == profesion 
    if len(users[condicion]) > max_value:
        max_value = len(users[condicion])
        max_prof = profesion

max_prof

'student'

### 14. Obtén un resumen de las principales medidas estadísticas de las variables numéricas.  Usa describe()

In [40]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### 15. Obtén un resumen de las principales medidas estadísticas de todas las variables.  Usa describe()

In [38]:
users.describe(include="all") # LA FUNCIÓN 'describe()' DEVUELVE TODAS LAS MEDIDAS ESTADISTICAS DE LA TABLA DE DATOS

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [39]:
display(users.describe(), users.describe(include="object"))

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

### 16. Obtén un resumen de las principales medidas estadísticas de solo la columna occupation.  Usa describe()

In [68]:
# Obtener un resumen de las principales medidas estadísticas de la columna 'occupation'
resumen = users['occupation'].describe() 

print(resumen)

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### 17. ¿Cuál es la edad media?

In [41]:
import numpy as np

np.mean(users["age"])

34.05196182396607

### 18. ¿Cuál es la edad menos frecuente?

In [73]:
# Calcular la frecuencia de cada edad
frecuencia_edades = users['age'].value_counts()

# Encontrar la edad menos frecuente
edad_menos_frecuente = frecuencia_edades.idxmin() # LA FUNCIÓN 'idxmin()' DEVUELVE LA POSICIÓN EN DONDE SE ENCUENTRA EL DATO MENOR  
                                                   # SE LE ASIGNA A LA VARIABLE 'edad_menos_frecuente' EL VALOR QUE TIENE LA POSICIÓN DEVUELTA
                                                    # POR LA FUNCIÓN 'idxmin()'  
print(edad_menos_frecuente)                          # 7 ES EL NÚMERO MÁS CHICO DE ESA COLUMNA (REVISARLO MÁS ARRIBA EN CASO DE DUDA)

7